app/controllers/api/competences_controller.rb

    def index
      @competences = Competence.all
---
SELECT "competences".* FROM "competences"