app/controllers/competences_controller.rb

SELECT "competences".* FROM "competences"
---
  def index
    @competences = Competence.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by_id(@competence.user_id)

DELETE FROM "competences" WHERE "competences"."id" = ?  [["id", 3]]
---
  def destroy
    @competence.destroy

INSERT INTO "competences" ("name", "user_id", "lvl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dfgd"], ["user_id", 1], ["lvl", 1], ["created_at", 2017-03-29 17:28:45 UTC], ["updated_at", 2017-03-29 17:28:45 UTC]]
---
  def create
    @competence = Competence.new(competence_params)
    @competence.user_id = current_user.id
    respond_to do |format|
      if @competence.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "competences" SET "name" = ?, "lvl" = ?, "updated_at" = ? WHERE "competences"."id" = ?  [["name", "Test"], ["lvl", 3], ["updated_at", 2017-03-29 17:32:14 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      @user = User.find_by_id(@competence.user_id)
      if @competence.update(competence_params)

SELECT  "competences".* FROM "competences" WHERE "competences"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_competence
    @competence = Competence.find(params[:id])