app/views/competences/destroy.js.erb

DELETE FROM "competences" WHERE "competences"."id" = ?  [["id", 23]]
---
$('.delete_competence').bind('ajax:success', function() {
    $(this).closest('tr').fadeOut();
});