app/views/competences/show.html.haml

  %strong Author:
  - @user = User.find_by_id(@competence.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]